# GetFileReadErrors Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
KeyBasedTreeEntriesLoadResults..::..GetFileReadErrors Method
KeyBasedTreeEntriesLoadResults Class See Also
---
Gets the names of any files which could not be read due to access errors.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public IList<string> GetFileReadErrors()
```

Visual Basic
---
```text
Public Function GetFileReadErrors As IList(Of String)
```

Visual C++
---
```text
public:
IList<String^>^ GetFileReadErrors()
```

# ### Return Value
An array of strings containing the filenames of files which could not be read.
# Remarks
Only applies to KeyBasedTreeEntries built from text files.
# See Also
KeyBasedTreeEntriesLoadResults Class
Autodesk.Revit.DB Namespace